perf/root.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    node_replicated:
      target: 'http://localhost:5555/node_replicated/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node_replicated"
    gunicorn:
      target: 'http://localhost:5555/gunicorn/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 120
      arrivalRate: 30

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'